# Протокол HTTP
# 5. Исходный код страницы

"""
Вы наблюдали, как браузер показывает веб-страницу с результатами поиска. Давайте разберёмся, как клиент вообще сумел понять, что нужно отобразить именно её.

У веб-страниц, как и у программ, есть исходный код. Давайте откроем его. 
В браузерах он доступен через меню: смотрим код страницы

Смотрите: браузер получил от сервера страницу, размеченную на языке HTML. Это и есть её исходный код. Браузер прочитал его и отрисовал страницу для пользователя.

Примечание: все популярные браузеры — Google Chrome, Mozilla Firefox, Internet Explorer (Microsoft Edge), Safari — тоже показывают исходный код страницы, но меню у них устроено несколько иначе.

HTML расшифровывается как Hyper Text Markup Language (англ. «язык разметки гипертекста»). Обычный текст, написанный на любом из человеческих языков, разметка превращает в гипертекст (в буквальном переводе «больше, чем текст») — с устойчивым форматированием и работающими ссылками.

Научиться писать на этом языке можно на курсе фронтенд-разработки.
"""

"""
Ответ
<!-- Яндекс — найдётся всё. Может даже ляпы в коде. --> А специально для любителей попридираться в этой фразе ещё и запятой не хватает. После слова «Может».
"""


