# Протокол HTTP
# Заключение

"""
Осталась одна тема!
Прежде вы как пользователь писали свои вопросы поисковой машине и не нуждались в знании, что такое клиент, сервер и как они взаимодействуют по протоколу HTTP. Вы управляли клиентом. Это несложно. А сейчас добро пожаловать на серверную сторону! За те программы, что работают здесь, отвечает бэкенд-разработчик.
Код, который вы уже написали, вполне годен и для настоящего «бэкенда». Можете смело поручать Анфисе отправку HTTP-запросов к существующим в интернете сервисам. Вы получите HTTP-ответы, обработаете их — и ничего страшного не случится.

"""